# DocumentWorksharingEnabledEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentWorksharingEnabledEventArgs Properties
DocumentWorksharingEnabledEventArgs Class See Also
---
The DocumentWorksharingEnabledEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |

# See Also
DocumentWorksharingEnabledEventArgs Class
Autodesk.Revit.DB.Events Namespace